`$ terraform apply
var.region
  Enter a value: us-west-2

var.service_vpc_id
  Enter a value: vpc-0a1cf9e368e8c24f0


Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.odf_sg will be created
  + resource "aws_security_group" "odf_sg" {
      + arn                    = (known after apply)
      + description            = "ODF Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "osd-sec-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0a1cf9e368e8c24f0"

      + timeouts {
          + create = "20m"
        }
    }

  # aws_security_group_rule.odf_egress will be created
  + resource "aws_security_group_rule" "odf_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "default"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.odf_ingres_mgr will be created
  + resource "aws_security_group_rule" "odf_ingres_mgr" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "ODF Ceph Mgr"
      + from_port                = 9283
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9283
      + type                     = "ingress"
    }

  # aws_security_group_rule.odf_ingres_mon1 will be created
  + resource "aws_security_group_rule" "odf_ingres_mon1" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "ODF Ceph Mon v1"
      + from_port                = 6789
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6789
      + type                     = "ingress"
    }

  # aws_security_group_rule.odf_ingres_mon2 will be created
  + resource "aws_security_group_rule" "odf_ingres_mon2" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "ODF Ceph Mon v2"
      + from_port                = 3300
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3300
      + type                     = "ingress"
    }

  # aws_security_group_rule.odf_ingres_osd will be created
  + resource "aws_security_group_rule" "odf_ingres_osd" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "ODF Ceph OSD"
      + from_port                = 6800
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 7300
      + type                     = "ingress"
    }

  # aws_security_group_rule.odf_ingres_pro_api will be created
  + resource "aws_security_group_rule" "odf_ingres_pro_api" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "ODF Provider API"
      + from_port                = 31659
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 31659
      + type                     = "ingress"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_security_group.odf_sg: Creating...
aws_security_group.odf_sg: Creation complete after 2s [id=sg-0e222a8a089f24060]
aws_security_group_rule.odf_ingres_mgr: Creating...
aws_security_group_rule.odf_ingres_pro_api: Creating...
aws_security_group_rule.odf_egress: Creating...
aws_security_group_rule.odf_ingres_mon1: Creating...
aws_security_group_rule.odf_ingres_mon2: Creating...
aws_security_group_rule.odf_ingres_osd: Creating...
aws_security_group_rule.odf_ingres_mgr: Creation complete after 1s [id=sgrule-2251129342]
aws_security_group_rule.odf_egress: Creation complete after 1s [id=sgrule-2623987482]
aws_security_group_rule.odf_ingres_mon1: Creation complete after 2s [id=sgrule-447897149]
aws_security_group_rule.odf_ingres_pro_api: Still creating... [10s elapsed]
aws_security_group_rule.odf_ingres_mon2: Still creating... [10s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [10s elapsed]
aws_security_group_rule.odf_ingres_pro_api: Still creating... [20s elapsed]
aws_security_group_rule.odf_ingres_mon2: Still creating... [20s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [20s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [30s elapsed]
aws_security_group_rule.odf_ingres_mon2: Still creating... [30s elapsed]
aws_security_group_rule.odf_ingres_pro_api: Still creating... [30s elapsed]
aws_security_group_rule.odf_ingres_pro_api: Still creating... [40s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [40s elapsed]
aws_security_group_rule.odf_ingres_mon2: Still creating... [40s elapsed]
aws_security_group_rule.odf_ingres_mon2: Still creating... [50s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [50s elapsed]
aws_security_group_rule.odf_ingres_pro_api: Still creating... [50s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [1m0s elapsed]
aws_security_group_rule.odf_ingres_pro_api: Still creating... [1m0s elapsed]
aws_security_group_rule.odf_ingres_mon2: Still creating... [1m0s elapsed]
aws_security_group_rule.odf_ingres_mon2: Still creating... [1m10s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [1m10s elapsed]
aws_security_group_rule.odf_ingres_pro_api: Still creating... [1m10s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [1m20s elapsed]
aws_security_group_rule.odf_ingres_mon2: Still creating... [1m20s elapsed]
aws_security_group_rule.odf_ingres_pro_api: Still creating... [1m20s elapsed]
aws_security_group_rule.odf_ingres_pro_api: Still creating... [1m30s elapsed]
aws_security_group_rule.odf_ingres_mon2: Still creating... [1m30s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [1m30s elapsed]
aws_security_group_rule.odf_ingres_pro_api: Still creating... [1m40s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [1m40s elapsed]
aws_security_group_rule.odf_ingres_mon2: Still creating... [1m40s elapsed]
aws_security_group_rule.odf_ingres_pro_api: Still creating... [1m50s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [1m50s elapsed]
aws_security_group_rule.odf_ingres_mon2: Still creating... [1m50s elapsed]
aws_security_group_rule.odf_ingres_mon2: Still creating... [2m0s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [2m0s elapsed]
aws_security_group_rule.odf_ingres_pro_api: Still creating... [2m0s elapsed]
aws_security_group_rule.odf_ingres_pro_api: Still creating... [2m10s elapsed]
aws_security_group_rule.odf_ingres_mon2: Still creating... [2m10s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [2m10s elapsed]
aws_security_group_rule.odf_ingres_mon2: Still creating... [2m20s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [2m20s elapsed]
aws_security_group_rule.odf_ingres_pro_api: Still creating... [2m20s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [2m30s elapsed]
aws_security_group_rule.odf_ingres_mon2: Still creating... [2m30s elapsed]
aws_security_group_rule.odf_ingres_pro_api: Still creating... [2m30s elapsed]
aws_security_group_rule.odf_ingres_pro_api: Creation complete after 2m40s [id=sgrule-574810051]
aws_security_group_rule.odf_ingres_mon2: Still creating... [2m40s elapsed]
aws_security_group_rule.odf_ingres_osd: Still creating... [2m40s elapsed]
aws_security_group_rule.odf_ingres_osd: Creation complete after 2m41s [id=sgrule-2032191425]
aws_security_group_rule.odf_ingres_mon2: Creation complete after 2m41s [id=sgrule-2939650098]

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.`